# Y Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..Y Property
XYZ Class See Also
---
Gets the second coordinate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Y { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Y As Double
	Get
```

Visual C++
---
```text
public:
property double Y {
	double get ();
}
```

# See Also
XYZ Class
Autodesk.Revit.DB Namespace